{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"inputs": {"gen_input:0": {"name": "gen_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "16"}, {"size": "16"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "gen_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/Const", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_densemult/gen_densemult/y", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape/1", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape/3", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_13", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/strided_slice/stack_1", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_1mult/gen_conv1_1mult/y", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult/y", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv3_2mult/gen_conv3_2mult/y", "op": "Const", "input": ["^gen_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_dense/BiasAdd", "op": "_FusedMatMul", "input": ["gen_input", "Func/StatefulPartitionedCall/input/_2", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_densemult/gen_densemult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_dense/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_densemult/gen_densemult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_densemult/gen_densemult"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_117/gen_reshape/Shape", "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack", "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1", "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_117/gen_reshape/strided_slice", "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape/1", "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape/1", "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_densemult/gen_densemult", "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_reshape/Reshape", "Func/StatefulPartitionedCall/input/_4", "Func/StatefulPartitionedCall/input/_5"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_conv1/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_lrelu1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/Square", "op": "Square", "input": ["StatefulPartitionedCall/model_117/gen_lrelu1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/Square", "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean", "StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_lrelu1/LeakyRelu", "StatefulPartitionedCall/model_117/gen_pixelnorm1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv2/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/mul", "Func/StatefulPartitionedCall/input/_6", "Func/StatefulPartitionedCall/input/_7"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv2mult/gen_conv2mult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_conv2/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_lrelu2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_conv2mult/gen_conv2mult"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2/Square", "op": "Square", "input": ["StatefulPartitionedCall/model_117/gen_lrelu2/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2/Square", "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y", "StatefulPartitionedCall/model_117/gen_pixelnorm2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_lrelu2/LeakyRelu", "StatefulPartitionedCall/model_117/gen_pixelnorm2/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv3/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2/mul", "Func/StatefulPartitionedCall/input/_8", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_117/gen_conv3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_117/gen_upsamp_1/Shape", "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1", "StatefulPartitionedCall/model_117/gen_upsamp_1/strided_slice/stack_1", "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_upsamp_1/Const", "StatefulPartitionedCall/model_117/gen_upsamp_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model_117/gen_conv3/BiasAdd", "StatefulPartitionedCall/model_117/gen_upsamp_1/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv1_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_upsamp_1/resize/ResizeNearestNeighbor", "Func/StatefulPartitionedCall/input/_10", "Func/StatefulPartitionedCall/input/_11"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_1mult/gen_conv1_1mult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_conv1_1/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_1mult/gen_conv1_1mult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_lrelu1_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_1mult/gen_conv1_1mult"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_1/Square", "op": "Square", "input": ["StatefulPartitionedCall/model_117/gen_lrelu1_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1_1/Square", "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y", "StatefulPartitionedCall/model_117/gen_pixelnorm1_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_lrelu1_1/LeakyRelu", "StatefulPartitionedCall/model_117/gen_pixelnorm1_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv2_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1_1/mul", "Func/StatefulPartitionedCall/input/_12", "Func/StatefulPartitionedCall/input/_13"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv2_1mult/gen_conv2_1mult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_conv2_1/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_lrelu2_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_conv2_1mult/gen_conv2_1mult"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_1/Square", "op": "Square", "input": ["StatefulPartitionedCall/model_117/gen_lrelu2_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2_1/Square", "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y", "StatefulPartitionedCall/model_117/gen_pixelnorm2_1/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_lrelu2_1/LeakyRelu", "StatefulPartitionedCall/model_117/gen_pixelnorm2_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv3_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2_1/mul", "Func/StatefulPartitionedCall/input/_14", "Func/StatefulPartitionedCall/input/_15"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_117/gen_conv3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_117/gen_upsamp_2/Shape", "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1", "StatefulPartitionedCall/model_117/gen_upsamp_1/strided_slice/stack_1", "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_upsamp_1/Const", "StatefulPartitionedCall/model_117/gen_upsamp_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/model_117/gen_conv3_1/BiasAdd", "StatefulPartitionedCall/model_117/gen_upsamp_2/mul"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv1_2/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_upsamp_2/resize/ResizeNearestNeighbor", "Func/StatefulPartitionedCall/input/_16", "Func/StatefulPartitionedCall/input/_17"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_2mult/gen_conv1_2mult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_conv1_2/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_1mult/gen_conv1_1mult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_lrelu1_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_2mult/gen_conv1_2mult"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_2/Square", "op": "Square", "input": ["StatefulPartitionedCall/model_117/gen_lrelu1_2/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_2/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1_2/Square", "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y", "StatefulPartitionedCall/model_117/gen_pixelnorm1_2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_2/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_lrelu1_2/LeakyRelu", "StatefulPartitionedCall/model_117/gen_pixelnorm1_2/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv2_2/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1_2/mul", "Func/StatefulPartitionedCall/input/_18", "Func/StatefulPartitionedCall/input/_19"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv2_2mult/gen_conv2_2mult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_conv2_2/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_lrelu2_2/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_conv2_2mult/gen_conv2_2mult"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.20000000298023224}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_2/Square", "op": "Square", "input": ["StatefulPartitionedCall/model_117/gen_lrelu2_2/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_2/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2_2/Square", "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y", "StatefulPartitionedCall/model_117/gen_pixelnorm2_2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_2/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm2_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_lrelu2_2/LeakyRelu", "StatefulPartitionedCall/model_117/gen_pixelnorm2_2/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_117/gen_conv3_2/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_117/gen_pixelnorm2_2/mul", "Func/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv3_2mult/gen_conv3_2mult", "op": "Mul", "input": ["StatefulPartitionedCall/model_117/gen_conv3_2/BiasAdd", "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv3_2mult/gen_conv3_2mult/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_117/tf_op_layer_gen_conv3_2mult/gen_conv3_2mult"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [100, 2048], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [2048], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_densemult/gen_densemult/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/add/y", "shape": [], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [1, 1, 128, 3], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [3], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [3, 3, 3, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_12", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_13", "shape": [128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [1, 1, 128, 3], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/gen_upsamp_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_117/gen_reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_16", "shape": [3, 3, 3, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_17", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1_1mult/gen_conv1_1mult/y", "shape": [], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_18", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_19", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv1mult/gen_conv1mult/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/gen_pixelnorm1/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [1, 1, 128, 3], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_117/tf_op_layer_gen_conv3_2mult/gen_conv3_2mult/y", "shape": [], "dtype": "float32"}]}]}